export interface ITender {
  id: number;
  name: string;
  startDate: Date;
  endDate: Date;
  location: string;
  category: string;
  description: string;
}

export const TENDER_MOCK: ITender[] = [
  {
    id: 1,
    name: "«Ճանապարհային դեպարտամենտ»",
    startDate: new Date("2024-05-20T22:15:00.000Z"),
    endDate: new Date("2024-05-20T23:15:00.000Z"),
    location: "Yerevan",
    category: "Մենեջմենտ",
    description:
      "«Ճանապարհային դեպարտամենտ» հիմնադրամի կարիքների համար ֆինանսական աուդիտի անցկացման ծառայությունների ձեռքբերման նպատակով հայտարարված գնանշման հարցում։Հայտերի ներկայացման հրավեր ՃԴ-ԳՀԾՁԲ-2023/02    ",
  },
  {
    id: 2,
    name: "«Ճանապարհային դեպարտամենտ»",
    startDate: new Date("2024-05-20T22:15:00.000Z"),
    endDate: new Date("2024-05-20T23:15:00.000Z"),
    location: "Yerevan",
    category: "Մենեջմենտ",
    description:
      "«Ճանապարհային դեպարտամենտ» հիմնադրամի կարիքների համար ֆինանսական աուդիտի անցկացման ծառայությունների ձեռքբերման նպատակով հայտարարված գնանշման հարցում։Հայտերի ներկայացման հրավեր ՃԴ-ԳՀԾՁԲ-2023/02    ",
  },
  {
    id: 3,
    name: "«Ճանապարհային դեպարտամենտ»",
    startDate: new Date("2024-05-20T22:15:00.000Z"),
    endDate: new Date("2024-05-20T23:15:00.000Z"),
    location: "Yerevan",
    category: "Մենեջմենտ",
    description:
      "«Ճանապարհային դեպարտամենտ» հիմնադրամի կարիքների համար ֆինանսական աուդիտի անցկացման ծառայությունների ձեռքբերման նպատակով հայտարարված գնանշման հարցում։Հայտերի ներկայացման հրավեր ՃԴ-ԳՀԾՁԲ-2023/02    ",
  },
  {
    id: 4,
    name: "«Ճանապարհային դեպարտամենտ»",
    startDate: new Date("2024-05-20T22:15:00.000Z"),
    endDate: new Date("2024-05-20T23:15:00.000Z"),
    location: "Yerevan",
    category: "Մենեջմենտ",
    description:
      "«Ճանապարհային դեպարտամենտ» հիմնադրամի կարիքների համար ֆինանսական աուդիտի անցկացման ծառայությունների ձեռքբերման նպատակով հայտարարված գնանշման հարցում։Հայտերի ներկայացման հրավեր ՃԴ-ԳՀԾՁԲ-2023/02    ",
  },
  {
    id: 5,
    name: "«Ճանապարհային դեպարտամենտ»",
    startDate: new Date("2024-05-20T22:15:00.000Z"),
    endDate: new Date("2024-05-20T23:15:00.000Z"),
    location: "Yerevan",
    category: "Մենեջմենտ",
    description:
      "«Ճանապարհային դեպարտամենտ» հիմնադրամի կարիքների համար ֆինանսական աուդիտի անցկացման ծառայությունների ձեռքբերման նպատակով հայտարարված գնանշման հարցում։Հայտերի ներկայացման հրավեր ՃԴ-ԳՀԾՁԲ-2023/02    ",
  },
];
